DAMA.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-05 Sun 14:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DAMA</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">DAMA</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgee0f085">1. DAMA</a>
<ul>
<li><a href="#org8004336">1.1. Motivation for Data Management</a></li>
<li><a href="#org4edac63">1.2. Motivation for Research Data Management</a></li>
<li><a href="#orgac093d8">1.3. Key difference between Data management Vs Data Science</a></li>
<li><a href="#orgcf527fd">1.4. Data Science Life Cycle</a></li>
<li><a href="#org36fc1cd">1.5. Research Data Life Cycle</a></li>
<li><a href="#org8f96ab9">1.6. Research Data Life Cycle 2</a></li>
<li><a href="#org36034de">1.7. Storage &amp; Preseveration</a></li>
</ul>
</li>
<li><a href="#orgd876d3f">2. Data Model</a>
<ul>
<li><a href="#orgb430578">2.1. model</a></li>
<li><a href="#org572e7bf">2.2. data moduling technologies</a></li>
<li><a href="#orgdc3a984">2.3. Data modul Types</a></li>
<li><a href="#org7b6ae09">2.4. Data Type</a>
<ul>
<li><a href="#org821de06">2.4.1. Structured</a></li>
<li><a href="#org354e0b7">2.4.2. Semi-Structured</a></li>
<li><a href="#org5ba1555">2.4.3. Unstuctured</a></li>
</ul>
</li>
<li><a href="#org67ff23f">2.5. Data Acquire</a></li>
</ul>
</li>
<li><a href="#orgca4d786">3. Database</a>
<ul>
<li><a href="#orgf3bf942">3.1. Hierarchical database</a></li>
<li><a href="#orgfb3b6e8">3.2. Network database</a></li>
<li><a href="#orgf657530">3.3. Relational Database</a></li>
<li><a href="#orgde48df5">3.4. Object-Oriented Database</a></li>
<li><a href="#org5df7891">3.5. No-SQL database</a></li>
<li><a href="#org4fd5f85">3.6. ACID compliance</a></li>
<li><a href="#orgd8392b5">3.7. CAP Theorem</a></li>
<li><a href="#org5459624">3.8. ETL Process</a></li>
<li><a href="#org2073ef0">3.9. Data Warehouse</a></li>
<li><a href="#org36a550c">3.10. Database</a></li>
<li><a href="#org9cb11d4">3.11. Data Marts</a></li>
<li><a href="#orged92e63">3.12. Data Lake</a></li>
<li><a href="#org2980a7e">3.13. Data Mesh</a></li>
<li><a href="#org07c73af">3.14. Data Fabric</a></li>
</ul>
</li>
<li><a href="#org3942a63">4. Meta Data</a>
<ul>
<li><a href="#org9344287">4.1. FAIR Principes</a></li>
<li><a href="#orgf3ad3af">4.2. Type</a></li>
<li><a href="#org7db02ff">4.3. direction</a></li>
<li><a href="#org539d961">4.4. Meaning</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgee0f085" class="outline-2">
<h2 id="orgee0f085"><span class="section-number-2">1</span> DAMA</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8004336" class="outline-3">
<h3 id="org8004336"><span class="section-number-3">1.1</span> Motivation for Data Management</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Visibility</li>
<li>Reliability</li>
<li>Security</li>
<li>Scalability</li>
</ul>
</div>
</div>
<div id="outline-container-org4edac63" class="outline-3">
<h3 id="org4edac63"><span class="section-number-3">1.2</span> Motivation for Research Data Management</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>the amonut of data growth fast</li>
<li>new technologies</li>
<li>more accessible data due to standardisation</li>
<li>Required by funding agency</li>
<li>Scientific</li>
</ul>
</div>
</div>
<div id="outline-container-orgac093d8" class="outline-3">
<h3 id="orgac093d8"><span class="section-number-3">1.3</span> Key difference between Data management Vs Data Science</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Acquisition</li>
<li>Storage</li>
<li>Quality</li>
<li>Governance</li>
<li>Integrity</li>
</ul>
</div>
</div>

<div id="outline-container-orgcf527fd" class="outline-3">
<h3 id="orgcf527fd"><span class="section-number-3">1.4</span> Data Science Life Cycle</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Acquirement, clean, <b>explore, preprocessing, model</b>, validation, present
</p>
</div>
</div>
<div id="outline-container-org36fc1cd" class="outline-3">
<h3 id="org36fc1cd"><span class="section-number-3">1.5</span> Research Data Life Cycle</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<b>Plan</b>, Collect, Assure, Describe, Submit, Preserve, Discover, Integrate, Analysis, Publish
</p>
</div>
</div>
<div id="outline-container-org8f96ab9" class="outline-3">
<h3 id="org8f96ab9"><span class="section-number-3">1.6</span> Research Data Life Cycle 2</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Analysis   &lt;- discovery
\(\downarrow\)                 \(\uparrow\)           Archiving
processing -&gt; Distribution
</p>

<ul class="org-ul">
<li>version controll</li>
<li>provenance</li>
<li>normalization</li>
<li>integrity preservation</li>
<li>curation</li>
</ul>
</div>
</div>
<div id="outline-container-org36034de" class="outline-3">
<h3 id="org36034de"><span class="section-number-3">1.7</span> Storage &amp; Preseveration</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>storage, mid-term, on my own disk</li>
<li>preseveration, long term, accessible for other</li>
<li>321</li>
<li>Accessibility, Authenticity, Longevity</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-orgd876d3f" class="outline-2">
<h2 id="orgd876d3f"><span class="section-number-2">2</span> Data Model</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb430578" class="outline-3">
<h3 id="orgb430578"><span class="section-number-3">2.1</span> model</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>why? to save the data in the database or information system</li>
<li>conceptual representation of data objects, associcated with other data object</li>
<li>benefits, helpful for visual representation, busisess rules, regulatory compliances, consistancy conventions</li>
</ul>
</div>
</div>
<div id="outline-container-org572e7bf" class="outline-3">
<h3 id="org572e7bf"><span class="section-number-3">2.2</span> data moduling technologies</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>ERM, Entity Relation Model</li>
<li>UML, Unified Modeling Language</li>
</ul>
</div>
</div>
<div id="outline-container-orgdc3a984" class="outline-3">
<h3 id="orgdc3a984"><span class="section-number-3">2.3</span> Data modul Types</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Conceptual</li>
<li>Logical</li>
<li>Physical</li>
</ul>
</div>
</div>
<div id="outline-container-org7b6ae09" class="outline-3">
<h3 id="org7b6ae09"><span class="section-number-3">2.4</span> Data Type</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org821de06" class="outline-4">
<h4 id="org821de06"><span class="section-number-4">2.4.1</span> Structured</h4>
</div>


<div id="outline-container-org354e0b7" class="outline-4">
<h4 id="org354e0b7"><span class="section-number-4">2.4.2</span> Semi-Structured</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
self-describing structur
json, XML, Email, Key-value-Store
</p>
</div>
</div>

<div id="outline-container-org5ba1555" class="outline-4">
<h4 id="org5ba1555"><span class="section-number-4">2.4.3</span> Unstuctured</h4>
</div>
</div>
<div id="outline-container-org67ff23f" class="outline-3">
<h3 id="org67ff23f"><span class="section-number-3">2.5</span> Data Acquire</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Harvesting
from external into system storage</li>

<li>Ingesting
fro different storages to different step for processing</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgca4d786" class="outline-2">
<h2 id="orgca4d786"><span class="section-number-2">3</span> Database</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf3bf942" class="outline-3">
<h3 id="orgf3bf942"><span class="section-number-3">3.1</span> Hierarchical database</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>hierarchical structured</li>
<li>1 to 1, 1 to n,</li>
<li>XML</li>
</ul>
</div>
</div>
<div id="outline-container-orgfb3b6e8" class="outline-3">
<h3 id="orgfb3b6e8"><span class="section-number-3">3.2</span> Network database</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Predecessor of relational database</li>
<li>more than one parent</li>
<li>allow n to n</li>
<li>uses a direct graph with direct link</li>
<li>can becomes a complex structure</li>
</ul>
</div>
</div>
<div id="outline-container-orgf657530" class="outline-3">
<h3 id="orgf657530"><span class="section-number-3">3.3</span> Relational Database</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>not sufficient for fast growth of big data and its complexity</li>
<li>hard to scale horizontally</li>
<li>Normalization, reduce the disk space</li>
<li>DeNormalization, fast and optimised for query</li>
<li>Snowflake schema,
<ul class="org-ul">
<li>less disk space</li>
<li>normalized</li>
<li>minimal redundency</li>
<li>powerful for data analysis</li>
<li>allow many to many relationship</li>
</ul></li>
<li>Star Schema(denormalization)
<ul class="org-ul">
<li>simple to understand and build</li>
<li>fast querying, no join</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgde48df5" class="outline-3">
<h3 id="orgde48df5"><span class="section-number-3">3.4</span> Object-Oriented Database</h3>
</div>
<div id="outline-container-org5df7891" class="outline-3">
<h3 id="org5df7891"><span class="section-number-3">3.5</span> No-SQL database</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>for big data</li>
</ul>
</div>
</div>

<div id="outline-container-org4fd5f85" class="outline-3">
<h3 id="org4fd5f85"><span class="section-number-3">3.6</span> ACID compliance</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>potential failures, server, power, OS</li>
<li>Atomicity</li>
<li>Consistency</li>
<li>Isolation</li>
<li>Durablity
<a href="https://www.ibm.com/docs/en/cics-ts/5.4?topic=processing-acid-properties-transactions">IMB Statement</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd8392b5" class="outline-3">
<h3 id="orgd8392b5"><span class="section-number-3">3.7</span> CAP Theorem</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>Consistency</li>
<li>Availablity</li>
<li>Partition tolerance</li>
<li>sql(CAx), no-sql(xAP)</li>
</ul>
</div>
</div>
<div id="outline-container-org5459624" class="outline-3">
<h3 id="org5459624"><span class="section-number-3">3.8</span> ETL Process</h3>
<div class="outline-text-3" id="text-3-8">
<ul class="org-ul">
<li>E, Extract: Read data from source</li>
<li>L, Load, store data in the final data store</li>
<li>T, Transform: modify data based on the requirement</li>
<li>mostly is <b>ELT</b></li>
<li>but if the data source allow modification, <b>TEL</b> is  also possible</li>
</ul>
</div>
</div>

<div id="outline-container-org2073ef0" class="outline-3">
<h3 id="org2073ef0"><span class="section-number-3">3.9</span> Data Warehouse</h3>
<div class="outline-text-3" id="text-3-9">
<ul class="org-ul">
<li>integrated data from different source</li>
<li>resructure data (denormalization)</li>
<li>optimized for analysis</li>
<li>Building
<ul class="org-ul">
<li>Data source Layer: integrate internal and external data</li>
<li>Staging layer: conduct transformation</li>
<li>Storage Layer: host a database</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org36a550c" class="outline-3">
<h3 id="org36a550c"><span class="section-number-3">3.10</span> Database</h3>
<div class="outline-text-3" id="text-3-10">
<ul class="org-ul">
<li>real time data</li>
<li>optimized for modification and querying(very efficient)</li>
<li>normalized data</li>
</ul>
</div>
</div>
<div id="outline-container-org9cb11d4" class="outline-3">
<h3 id="org9cb11d4"><span class="section-number-3">3.11</span> Data Marts</h3>
<div class="outline-text-3" id="text-3-11">
<ul class="org-ul">
<li>subject-oriented database</li>
<li>to meet the specific group of users</li>
<li>data access with higher performance</li>
<li>Data maintenance, different department can have their own controll</li>
<li>Easy setup, simple design, required less technical</li>
<li>Analysis, KPIs,</li>
<li>Easy input</li>
</ul>
</div>
</div>
<div id="outline-container-orged92e63" class="outline-3">
<h3 id="orged92e63"><span class="section-number-3">3.12</span> Data Lake</h3>
<div class="outline-text-3" id="text-3-12">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">data Warehouse</td>
<td class="org-left">Data Lake</td>
</tr>

<tr>
<td class="org-left">processed</td>
<td class="org-left">raw</td>
</tr>

<tr>
<td class="org-left">structured</td>
<td class="org-left">all possible and raw</td>
</tr>

<tr>
<td class="org-left">ready for analysis</td>
<td class="org-left">open</td>
</tr>

<tr>
<td class="org-left">business user</td>
<td class="org-left">data scientists</td>
</tr>

<tr>
<td class="org-left">costly</td>
<td class="org-left">easy</td>
</tr>

<tr>
<td class="org-left">more secure</td>
<td class="org-left">less</td>
</tr>

<tr>
<td class="org-left">sql</td>
<td class="org-left">no sql</td>
</tr>

<tr>
<td class="org-left">fast result</td>
<td class="org-left">slow resulte</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org2980a7e" class="outline-3">
<h3 id="org2980a7e"><span class="section-number-3">3.13</span> Data Mesh</h3>
<div class="outline-text-3" id="text-3-13">
<ul class="org-ul">
<li>domain-oriented decentralized data owership and architecture</li>
<li>data as a product</li>
<li>self-serve data infrastructure as platform</li>
<li>federated computational governance</li>
<li>architecture for data governance</li>
</ul>
</div>
</div>

<div id="outline-container-org07c73af" class="outline-3">
<h3 id="org07c73af"><span class="section-number-3">3.14</span> Data Fabric</h3>
<div class="outline-text-3" id="text-3-14">
<ul class="org-ul">
<li>conceptual</li>
<li>focus on highly automating and integrating</li>
<li>need more matedata</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3942a63" class="outline-2">
<h2 id="org3942a63"><span class="section-number-2">4</span> Meta Data</h2>
<div class="outline-text-2" id="text-4">
<p>
Meta data is must, a connect(descripation) data of data, necessary for control and efficiency while processing data, also important and required for access and discovery.
problem, stored in different place also different form.
</p>
</div>
<div id="outline-container-org9344287" class="outline-3">
<h3 id="org9344287"><span class="section-number-3">4.1</span> FAIR Principes</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Findable</li>
<li>Accessable</li>
<li>interoperable</li>
<li>Reuseable</li>
<li>The principles emphasise <b>machine-actionability</b>, because humans increasingly rely on computational support to deal with data as a result of the increase in volume, complexity, and creation speed of data.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf3ad3af" class="outline-3">
<h3 id="orgf3ad3af"><span class="section-number-3">4.2</span> Type</h3>
</div>
<div id="outline-container-org7db02ff" class="outline-3">
<h3 id="org7db02ff"><span class="section-number-3">4.3</span> direction</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>who created it, what it is,  when, where, how, licence.</li>
</ul>
</div>
</div>
<div id="outline-container-org539d961" class="outline-3">
<h3 id="org539d961"><span class="section-number-3">4.4</span> Meaning</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Controlled Vocabular</li>
<li>Texonomies</li>
<li>Thesaui</li>
<li>Ontologies</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-02-05 Sun 14:46</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
